*Exercise 2.17:* Define a procedure `last-pair' that returns the
list that contains only the last element of a given (nonempty)
list:

    (last-pair (list 23 72 149 34))
    (34)

#+begin_src scheme
  (define (last-pair lat)
    (if (= (length lat) 1)
        lat
        (last-pair (cdr lat))))

  (last-pair (list 23 72 149 34))
#+end_src

#+RESULTS:
| 34 |
